import Mock from "mockjs"
// import { getNumber } from "./mockUtils"

// summary画面表示用データ
export const comment = {
    commentChartData: {
        value: Mock.Random.integer(0, 5),
        content: {
            title: "注意力は情報の選択的処理機能",
            content: "注意はその定義が非常に難儀であるが、多くの情報の中から情報を選択する心的機能であり、脳の限られた処理資源を有効に活用するために、不要な情報には処理資源を割り当てず、必要な情報だけを優先的に処理するといった資源の最適化を行う情報の選択的処理機能であると考えられています。",
            other: "膨大な量の感覚情報が大脳に届きますが、脳の情報処理量には限界があるので、そのうちの一部分の感覚情報だけを取捨選択して、いわば焦点を当てて情報処理しています。この特定の対象に意識を向ける働き「大切なことに意識を集中する働き」が注意機能の役割です。"
        }


    }
}



